---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.TypeRecursiveElementIdParameter
source: html/a0b35993-a378-816d-5b1b-6b35bc767173.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.TypeRecursiveElementIdParameter Property

Type's parameter cannot recursively point to the type itself.

## Syntax (C#)
```csharp
public static FailureDefinitionId TypeRecursiveElementIdParameter { get; }
```